In [2]:
import pandas as pd

In [8]:
# Reading tab separated csv file
df=pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",sep="\t")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [11]:
# info() is used to get the column name and dataype
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [23]:
# describe() - gives the statistical information of the dataset
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [16]:
# Display top 10 records of a dataframe
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [22]:
# Displays the top 10 "Name" column in a dataframe
df[["PassengerId","Name","SibSp"]].head(10)
# Note if you want only "Name", then use single [] or if you need more than 1, i.e "Name","PassengerId" and so on, give
# it in 2 [[]]

   PassengerId                                               Name  SibSp
0            1                            Braund, Mr. Owen Harris      1
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...      1
2            3                             Heikkinen, Miss. Laina      0
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1
4            5                           Allen, Mr. William Henry      0
5            6                                   Moran, Mr. James      0
6            7                            McCarthy, Mr. Timothy J      0
7            8                     Palsson, Master. Gosta Leonard      3
8            9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      0
9           10                Nasser, Mrs. Nicholas (Adele Achem)      1

In [ ]:
# Example of Shape

In [24]:
df=pd.read_csv("examples/ex6.csv")
df

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
# shape will gives you No of rows and column in a dataset
df.shape

(10000, 5)

In [28]:
# nrows=5 - displays the top 5 recrds in a dataset. We can use alos head()
df=pd.read_csv("examples/ex6.csv",nrows=5)
df

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
# Example - Chunk
# If we having millions of records in a file. If we want to load these data in pc, the computer will crash. So to
# avoid this, we are displaying chunks of data. (Chunks means - Part of data)

In [31]:
# chunksize=1000 , displays 1000 records at a time.
# I am having 10000 records, i am displaying 1000 data at a time.
df=pd.read_csv("examples/ex6.csv",chunksize=1000)
df

In [32]:
type(df)

pandas.io.parsers.TextFileReader

In [30]:
# The output in chunk is a "TextFileReader". so i am iterating to print the output
for i in df:
    print(i)

          one       two     three      four key
0    0.467976 -0.038649 -0.295344 -1.824726   L
1   -0.358893  1.404453  0.704965 -0.200638   B
2   -0.501840  0.659254 -0.421691 -0.057688   G
3    0.204886  1.074134  1.388361 -0.982404   R
4    0.354628 -0.133116  0.283763 -0.837063   Q
..        ...       ...       ...       ...  ..
995  2.311896 -0.417070 -1.409599 -0.515821   M
996 -0.479893 -0.650419  0.745152 -0.646038   H
997  0.523331  0.787112  0.486066  1.093156   D
998 -0.362559  0.598894 -1.843201  0.887292   W
999 -0.096376 -1.012999 -0.657431 -0.573315   K

[1000 rows x 5 columns]
           one       two     three      four key
1000  0.467976 -0.038649 -0.295344 -1.824726   T
1001 -0.358893  1.404453  0.704965 -0.200638   J
1002 -0.501840  0.659254 -0.421691 -0.057688   R
1003  0.204886  1.074134  1.388361 -0.982404   S
1004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
1995  2.311896 -0.417070 -1.409599 -0.515821   L
1996 -0.479893 -0.650419  0.745152 -0.646038   J
1997  0.523331  0.787112  0.486066  1.093156   V
1998 -0.362559  0.598894 -1.843201  0.887292   W
1999 -0.096376 -1.012999 -0.657431 -0.573315   D

[1000 rows x 5 columns]
           one       two     three      four key
2000  0.467976 -0.038649 -0.295344 -1.824726   1
2001 -0.358893  1.404453  0.704965 -0.200638   H
2002 -0.501840  0.659254 -0.421691 -0.057688   F
2003  0.204886  1.074134  1.388361 -0.982404   L
2004  0.354628 -0.133116  0.283763 -0.837063   E
...        ...       ...       ...       ...  ..
2995  2.311896 -0.417070 -1.409599 -0.515821   H
2996 -0.479893 -0.650419  0.745152 -0.646038   U
2997  0.523331  0.787112  0.486066  1.093156   A
2998 -0.362559  0.598894 -1.843201  0.887292   Y
2999 -0.096376 -1.012999 -0.657431 -0.573315   F

[1000 rows x 5 columns]
           one       two     three      four key
3000  0.467976 -0.038649 -0.295344 -1.824726   H
3001 -0.358893  1.404453  0.704965 -0.200638   Y
3002 -0.501840  0.659254 -0.421691 -0.057688   0
3003  0.204886  1.074134  1.388361 -0.982404   Z
3004  0.354628 -0.133116  0.283763 -0.837063   U
...        ...       ...       ...       ...  ..
3995  2.311896 -0.417070 -1.409599 -0.515821   W
3996 -0.479893 -0.650419  0.745152 -0.646038   E
3997  0.523331  0.787112  0.486066  1.093156   Q
3998 -0.362559  0.598894 -1.843201  0.887292   A
3999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
4000  0.467976 -0.038649 -0.295344 -1.824726   H
4001 -0.358893  1.404453  0.704965 -0.200638   Z
4002 -0.501840  0.659254 -0.421691 -0.057688   2
4003  0.204886  1.074134  1.388361 -0.982404   B
4004  0.354628 -0.133116  0.283763 -0.837063   1
...        ...       ...       ...       ...  ..
4995  2.311896 -0.417070 -1.409599 -0.515821   X
4996 -0.479893 -0.650419  0.745152 -0.646038   M
4997  0.523331  0.787112  0.486066  1.093156   5
4998 -0.362559  0.598894 -1.843201  0.887292   T
4999 -0.096376 -1.012999 -0.657431 -0.573315   U

[1000 rows x 5 columns]
           one       two     three      four key
5000  0.467976 -0.038649 -0.295344 -1.824726   1
5001 -0.358893  1.404453  0.704965 -0.200638   Z
5002 -0.501840  0.659254 -0.421691 -0.057688   3
5003  0.204886  1.074134  1.388361 -0.982404   H
5004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
5995  2.311896 -0.417070 -1.409599 -0.515821   1
5996 -0.479893 -0.650419  0.745152 -0.646038   Y
5997  0.523331  0.787112  0.486066  1.093156   F
5998 -0.362559  0.598894 -1.843201  0.887292   0
5999 -0.096376 -1.012999 -0.657431 -0.573315   3

[1000 rows x 5 columns]
           one       two     three      four key
6000  0.467976 -0.038649 -0.295344 -1.824726   I
6001 -0.358893  1.404453  0.704965 -0.200638   X
6002 -0.501840  0.659254 -0.421691 -0.057688   A
6003  0.204886  1.074134  1.388361 -0.982404   C
6004  0.354628 -0.133116  0.283763 -0.837063   S
...        ...       ...       ...       ...  ..
6995  2.311896 -0.417070 -1.409599 -0.515821   P
6996 -0.479893 -0.650419  0.745152 -0.646038   9
6997  0.523331  0.787112  0.486066  1.093156   L
6998 -0.362559  0.598894 -1.843201  0.887292   5
6999 -0.096376 -1.012999 -0.657431 -0.573315   O

[1000 rows x 5 columns]
           one       two     three      four key
7000  0.467976 -0.038649 -0.295344 -1.824726   1
7001 -0.358893  1.404453  0.704965 -0.200638   I
7002 -0.501840  0.659254 -0.421691 -0.057688   H
7003  0.204886  1.074134  1.388361 -0.982404   P
7004  0.354628 -0.133116  0.283763 -0.837063   D
...        ...       ...       ...       ...  ..
7995  2.311896 -0.417070 -1.409599 -0.515821   A
7996 -0.479893 -0.650419  0.745152 -0.646038   6
7997  0.523331  0.787112  0.486066  1.093156   R
7998 -0.362559  0.598894 -1.843201  0.887292   R
7999 -0.096376 -1.012999 -0.657431 -0.573315   2

[1000 rows x 5 columns]
           one       two     three      four key
8000  0.467976 -0.038649 -0.295344 -1.824726   7
8001 -0.358893  1.404453  0.704965 -0.200638   W
8002 -0.501840  0.659254 -0.421691 -0.057688   C
8003  0.204886  1.074134  1.388361 -0.982404   S
8004  0.354628 -0.133116  0.283763 -0.837063   H
...        ...       ...       ...       ...  ..
8995  2.311896 -0.417070 -1.409599 -0.515821   W
8996 -0.479893 -0.650419  0.745152 -0.646038   N
8997  0.523331  0.787112  0.486066  1.093156   Q
8998 -0.362559  0.598894 -1.843201  0.887292   R
8999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
9000  0.467976 -0.038649 -0.295344 -1.824726   B
9001 -0.358893  1.404453  0.704965 -0.200638   M
9002 -0.501840  0.659254 -0.421691 -0.057688   N
9003  0.204886  1.074134  1.388361 -0.982404   N
9004  0.354628 -0.133116  0.283763 -0.837063   Y
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[1000 rows x 5 columns]

In [33]:
# Example : Converting data frame from one dataformat to another dataformat

# I am  reading a file in one dataformat and preprocessing the file and storing it in another data format

In [36]:
df=pd.read_csv("examples/ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
# converting to csv - We are reading ex5.csv, preprocessing the file and converting it to csv file using "to_csv" and
# storing in "new.csv"
df.to_csv("new.csv")

In [48]:
df.to_csv("neew.csv",sep="@") # We are changing the default separator of csv file from "," to "@"

In [42]:
# Converting to excel file.
df.to_excel("new1.xls")

In [43]:
# Converting to html file
df.to_html("new2.html")

In [47]:
df.to_json("new3.json") # Converting to json format
df1=pd.read_json("new3.json")  # Reading a json file
df1 # printing the output of json

  something  a   b     c   d message
0       one  1   2   3.0   4    None
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [56]:
import sys # The sys belongs to the system inbuilt function
df.to_csv("examples/ex1.csv")
df.to_csv(sys.stdout) # sys.stdout diplays the output in console same as it stored in file

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
# Example : Changing the empty values in the data set to "NULL" values in a dataset

In [61]:
df=pd.read_csv("examples/ex1.csv") 
df

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [60]:
import sys
df=pd.read_csv("examples/ex1.csv") # Reading the csv file
df.to_csv("new5.csv") # Converting to csv and storing in a new file name
df.to_csv(sys.stdout, na_rep="NULL") # I am reading the output in console, how the data is stored in a file.
# and i am inserting "NULL" to the empty values in the cell and displaying the output

,Unnamed: 0,something,a,b,c,d,message
0,0,one,1,2,3.0,4,NULL
1,1,two,5,6,NULL,8,world
2,2,three,9,10,11.0,12,foo

In [ ]:
# Example - Enabling and Disabling the Header, row index and column

In [62]:
df=pd.read_csv("examples/ex1.csv")
df

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [63]:
# Disbaling both header and and row index
df.to_csv("new6.csv", index=False, header=False)

In [64]:
# Disabling the row index
df.to_csv("new7.csv", index=False, header=True)

In [66]:
# Disabling the row index and enabling only the column names specified here
df.to_csv("new8.csv", index=False, columns=["a","b","c","d"])

In [ ]:
# Example - Date Ranges

In [67]:
dates=pd.date_range(start="2/5/2021", periods=10) # Printing the dates from 2/5/2021 to 14/2/2021. perirods will print
                                                    # the dates of that specified value. Default it will take daily
dates

DatetimeIndex(['2021-02-05', '2021-02-06', '2021-02-07', '2021-02-08',
               '2021-02-09', '2021-02-10', '2021-02-11', '2021-02-12',
               '2021-02-13', '2021-02-14'],
              dtype='datetime64[ns]', freq='D')

In [70]:
dates=pd.date_range(start="2/5/2021", periods=10, freq="M") # Printing the 10 months dates starting from 2/5/2021 
dates
# It basically print the last date of the month

DatetimeIndex(['2021-02-28', '2021-03-31', '2021-04-30', '2021-05-31',
               '2021-06-30', '2021-07-31', '2021-08-31', '2021-09-30',
               '2021-10-31', '2021-11-30'],
              dtype='datetime64[ns]', freq='M')

In [71]:
dates=pd.date_range(start="2/5/2021", periods=10, freq="3M") # Skipping the 3 months and printing the last date 
                                                             # of the month 
dates

DatetimeIndex(['2021-02-28', '2021-05-31', '2021-08-31', '2021-11-30',
               '2022-02-28', '2022-05-31', '2022-08-31', '2022-11-30',
               '2023-02-28', '2023-05-31'],
              dtype='datetime64[ns]', freq='3M')

In [75]:
# # Converting the dates in to array using np.arange
import numpy as np
dates=pd.date_range(start="2/5/2021", periods=7)
ts=pd.Series(np.arange(7),index=dates) # Converting the dates in to array using np.arange
ts

2021-02-05    0
2021-02-06    1
2021-02-07    2
2021-02-08    3
2021-02-09    4
2021-02-10    5
2021-02-11    6
Freq: D, dtype: int32

In [82]:
ts.to_csv("tseries.csv", header=False) # Coneverting the array into csv file 
!type tseries.csv 
# using type we are printing the output. "type" will takes files from the location and prints the output

2021-02-05,0
2021-02-06,1
2021-02-07,2
2021-02-08,3
2021-02-09,4
2021-02-10,5
2021-02-11,6

In [80]:
# Let us know our current directory
pwd

'C:\\Sanath\\Sanath_Learnings\\Python_Topics_Concepts_Examples\\Pandas'

In [ ]:
# Example - Working with Delimited Formats

In [88]:
import csv
f= open("examples/ex7.csv") # Opening the file
reader = csv.reader(f) # Reading the file that is opened
reader # Its in object. so we need to iterate to see the output
reader

In [89]:
for i in reader: # we are iterating to see the output in the file
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [93]:
# The above opening and reading the file we just done in 2 lines
import csv
with open("examples/ex7.csv") as f:
    lines=list(csv.reader(f))

In [95]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [97]:
header,values=lines[0],lines[1:]

In [99]:
# Converting the data into key value pairs i.e in dictionary format. Becasue later we can easily convert it into 
#json format
data_dict= {h:v for h,v in zip(header,zip(*values))}
data_dict
# Zip function used to group the values and i am using zip(*values) i am grouing one on one. * is a pointer

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [ ]:
# Example: Converting Strings into json and viceversa

# Steps
# 1. we having string data in the form of key value pairs
# 2. Converting the data into json
# converting the json data into dataframes

In [4]:
# Data in the form of srings
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
obj

'\n{"name": "Wes",\n "places_lived": ["United States", "Spain", "Germany"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n              {"name": "Katie", "age": 38,\n               "pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [6]:
import json
# Taking  string data in the form of key value pairs
obj = """ 
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
# Coverting the string data into json format using json.loads()
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [7]:
# Converting json format data into strings using 
asstr=json.dumps(result)
type(asstr)

str

In [9]:
# Converting the json data into dataframes
datas_frame=pd.DataFrame(result["siblings"],columns=["name","age","pets"])
datas_frame["pets"]

0              [Zeus, Zuko]
1    [Sixes, Stache, Cisco]
Name: pets, dtype: object

In [11]:
# Reading the json file
df=pd.read_json("examples/example.json")
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
# converting the file to json and printing
print(df.to_json()) # The orientation is in column wise
print(df.to_json(orient="records")) # The orientation is in row wise

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [11]:
# Example - Reading a HTML File and converting the date type from Object type to Date format type
df1=pd.read_html("examples/fdic_failed_bank_list.html")
len(df1)
result = df1[0]
result

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [12]:
result.info()
# Here we can see the closing and updated date is Object type. That is it is of string type.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              547 non-null    object
 1   City                   547 non-null    object
 2   ST                     547 non-null    object
 3   CERT                   547 non-null    int64
 4   Acquiring Institution  547 non-null    object
 5   Closing Date           547 non-null    object
 6   Updated Date           547 non-null    object
dtypes: int64(1), object(6)
memory usage: 30.0+ KB

In [16]:
# We need to convert String type to datetime type format
datetime_format=pd.to_datetime(result["Closing Date"])
datetime_format

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [24]:
# I want the day, month and year of the second record in the above data frame
print(pd.to_datetime(result["Closing Date"])[1].day)
print(pd.to_datetime(result["Closing Date"])[1].month)
print(pd.to_datetime(result["Closing Date"])[1].year)

19
8
2016

In [35]:
# We are finding the total number of records in the current month/day/year.
# hear we checking the total number of records in the month.
# we using value_counts() to find the total count for that month
datetime_format.dt.month.value_counts()

7     74
10    58
4     58
1     49
2     44
8     41
5     41
3     39
9     38
6     36
11    35
12    34
Name: Closing Date, dtype: int64

In [39]:
# Example- Binary Data Formats or Serialized formats
# If i having millions of records. If i want to read millions of records it takes some time. If i want to
# read that multiple times, it takes more time. So, we need to read that record for 1 time and converting it in to 
# Binary format or serializable format. so that we can access/read/write it easily next time.
# For converting file to Binary format we need to use pickle()
# Note- we can use pickle for read/write operations. We can convert any type of file to pickle

In [7]:
df1=pd.read_csv("examples/ex1.csv")
df1.to_pickle("binary_pickle")

In [9]:
df=pd.read_pickle("binary_pickle")
type(df)

pandas.core.frame.DataFrame

In [1]:
# Example :Web APIS

In [26]:
import requests
url="https://api.github.com/repos/pandas-dev/pandas/issues" # url
resp_=requests.get(url) # using requests we are passing the url
data=resp_.json() # we converting the resp_ into json format. The json format is in the form of list.
data[2]['user']['avatar_url'] # we are priting through the list index

'https://avatars.githubusercontent.com/u/7614606?v=4'

In [28]:
type(resp_)

requests.models.Response

In [29]:
# I am converting few columns into data frame from data set above
df=pd.DataFrame(data, columns=['number','title','label','state'])
df

    number                                              title  label state
0    39668           ⬆️ UPGRADE: Autoupdate pre-commit config    NaN  open
1    39667                           CLN: minor error msg fix    NaN  open
2    39666                     run database tests only #39550    NaN  open
3    39664                             PERF: ExpandingGroupby    NaN  open
4    39663               TST: split/collect/parametrize tests    NaN  open
5    39662        Enhancement dataframe to csv use zip method    NaN  open
6    39661                    TST/REF: collect indexing tests    NaN  open
7    39660  CLN: Styler Types for CSS variables on `ctx` o...    NaN  open
8    39658  DOC: pin sphinx theme to avoid mobile dropdown...    NaN  open
9    39656  BUG: Series[dt64tz].__setitem__(mask, differen...    NaN  open
10   39655  REGR: fix case all-NaN/numeric object column i...    NaN  open
11   39651          REF: implement Index._view, Index._rename    NaN  open
12   39650  BUG: equals/assert_numpy_array_equals with non...    NaN  open
13   39649  BUG: Categorical.from_codes casts nullable int...    NaN  open
14   39648                    DOC: fix an incomplete sentence    NaN  open
15   39644  fix #39556 (infer_freq not working with freq="...    NaN  open
16   39642              CLN: reorganise vars in `Styler` init    NaN  open
17   39641  Revert "Backport PR #39526 on branch 1.2.x (CI...    NaN  open
18   39640  DOC: Series.pad has template variables that ar...    NaN  open
19   39638  API: transform behaves differently with 'ffill...    NaN  open
20   39631  ENH: Series.explode_range minimal implementati...    NaN  open
21   39630                          ENH: Series.explode_range    NaN  open
22   39624             CI/TST: Disallow usage of pytest.xfail    NaN  open
23   39623  BUG: Series.loc raising KeyError for Iterator ...    NaN  open
24   39622   PERF: slowdown in groupby/resample mean() method    NaN  open
25   39621  BUG: Calling pop() on a row inside apply() aff...    NaN  open
26   39618                REF: simplify BlockManager.quantile    NaN  open
27   39617  BUG: .query() using uint64 column fails with T...    NaN  open
28   39616  BUG: astyping Categorical to nullable integer ...    NaN  open
29   39615  BUG: fix Categorical.astype for dtype=np.int32...    NaN  open

In [30]:
# Example - Interacting with the Databases

In [34]:
import sqlite3 as db

con=db.connect('mydata2.sqlite')
con.execute("DROP TABLE IF EXISTS TEST")
query=""" CREATE TABLE TEST (A VARCHAR(30), B VARCHAR(30), C REAL, D INTEGER);"""
con.execute(query)
con.commit()

In [38]:
# Inserting data into table "Test"
stmt= "INSERT INTO TEST VALUES(?,?,?,?)"
data =[("AAA", "BBB", 10, 20),
       ("BBB", "CCC", 10, 20),
       ("DDD", "EEE", 10, 20),
       ("FFF", "GGG", 10, 20)]
con.executemany(stmt,data)
con.commit()

In [60]:
# Reading a data from a table
query="SELECT * FROM TEST"
result = con.execute(query)
rows = result.fetchall()
rows

[('AAA', 'BBB', 10.0, 20),
 ('BBB', 'CCC', 10.0, 20),
 ('DDD', 'EEE', 10.0, 20),
 ('FFF', 'GGG', 10.0, 20)]

In [56]:
result.description

(('A', None, None, None, None, None, None),
 ('B', None, None, None, None, None, None),
 ('C', None, None, None, None, None, None),
 ('D', None, None, None, None, None, None))

In [48]:
# I  need the A B C D as row index. so i am using list comprehension
[x[0] for x in result.description]

['A', 'B', 'C', 'D']

In [57]:
pd.DataFrame(rows,columns=[x[0] for x in result.description])

     A    B     C   D
0  AAA  BBB  10.0  20
1  BBB  CCC  10.0  20
2  DDD  EEE  10.0  20
3  FFF  GGG  10.0  20